service-mediator-automation/src/test/resources/testfiles/DEV3/appointmentRequest/Connecthub-Inbound-AppointmentRequestProcessed.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header/>
	<S:Body>
		<AllscriptsMessageEnvelope xmlns="http://Allscripts.com/UAI/Schemas/2010/02/15" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<MessageDispatchHeader>
				<ID xmlns="">0906b2b2-e690-459f-82f0-20110426T11:04PM</ID>
				<Noun>AppointmentRequest</Noun>
				<Verb>Processed</Verb>
				<TimeStamp>9:36:36 PM</TimeStamp>
				<Description>Test Description</Description>
				<Originator/>
				<Destination/>
			</MessageDispatchHeader>
			<EntityContext>
				<KeyedValues>
					<KeyedValue>
						<Key>AccountID</Key>
						<Value>00000000000000099930</Value>
					</KeyedValue>
					<KeyedValue>
						<Key>SiteID</Key>
						<Value>2222222</Value>
					</KeyedValue>
					<KeyedValue>
						<Key>ProductID</Key>
						<Value>EEHR</Value>
					</KeyedValue>
					<KeyedValue>
						<Key>ProductVersion</Key>
						<Value>11.2</Value>
					</KeyedValue>
					<KeyedValue>
						<Key>OrgID</Key>
						<Value>5678</Value>
					</KeyedValue>
					<KeyedValue>
						<Key>DestinationSiteID</Key>
						<Value>??20971??</Value>
					</KeyedValue>
				</KeyedValues>
			</EntityContext>
			<MessageContent xmlns="">
				<AptRequestProcessed SchemaName="AptRequestProcessed " xsi:schemaLocation="urn:Allscripts:Hub:PatientMsg PortalPHRMsg.xsd" xmlns="urn:Allscripts:Hub:PatientMsg" xmlns:mombt="urn:Allscripts:mombt">
					<PatientMsgBase Audience="text" ReceiptRequired="false">
						<mombt:MessageID>String</mombt:MessageID>
						<mombt:ReplyToMessageID>??147047??</mombt:ReplyToMessageID>
					<mombt:Subject>??test AR msg??</mombt:Subject>
						<mombt:Content>??Please be avaliable on scheduled time??</mombt:Content>
						<mombt:Patient Audience="text">
							<mombt:Mrn>?20130801276?</mombt:Mrn>
							<mombt:IDs Audience="text">
								<mombt:CodeValue>??49317??</mombt:CodeValue>
								<mombt:CodeDescription>Patient</mombt:CodeDescription>
								<mombt:CodeType>Id</mombt:CodeType>
								<mombt:CodingSystem>Intuit</mombt:CodingSystem>
								<mombt:Extended>
									<mombt:AlternativeCodeValue>String</mombt:AlternativeCodeValue>
									<mombt:AlternativeCodeDescription>String</mombt:AlternativeCodeDescription>
									<mombt:AlternativeCodeType>String</mombt:AlternativeCodeType>
									<mombt:AlternativeCodingSystem>String</mombt:AlternativeCodingSystem>
									<mombt:AssigningAuthority>
										<mombt:NamespaceID>String</mombt:NamespaceID>
										<mombt:UniversalID>String</mombt:UniversalID>
										<mombt:UniversalIDType>String</mombt:UniversalIDType>
									</mombt:AssigningAuthority>
									<mombt:CheckDigit>
										<mombt:CheckDigitType>NPI</mombt:CheckDigitType>
										<mombt:CheckDigitValue>String</mombt:CheckDigitValue>
									</mombt:CheckDigit>
									<mombt:AssigningFacility>
										<mombt:NamespaceID>String</mombt:NamespaceID>
										<mombt:UniversalID>String</mombt:UniversalID>
										<mombt:UniversalIDType>String</mombt:UniversalIDType>
									</mombt:AssigningFacility>
								</mombt:Extended>
							</mombt:IDs>
							<mombt:Name Audience="text">
								<mombt:Title>String</mombt:Title>
								<mombt:First>String</mombt:First>
								<mombt:Middle>String</mombt:Middle>
								<mombt:Last>String</mombt:Last>
								<mombt:Suffix>String</mombt:Suffix>
								<mombt:NameType>Legal</mombt:NameType>
								<mombt:Degree>String</mombt:Degree>
							</mombt:Name>
							<mombt:Ssn>String</mombt:Ssn>
							<mombt:DateOfBirth>1967-08-13</mombt:DateOfBirth>
							<mombt:Gender>U</mombt:Gender>
						</mombt:Patient>
						<mombt:Provider Audience="text">
							<mombt:Npi>91171</mombt:Npi>
							<mombt:Role>String</mombt:Role>
							<mombt:IDs Audience="text">
								<mombt:CodeValue>??22393??</mombt:CodeValue>
								<mombt:CodeDescription>Provider</mombt:CodeDescription>
								<mombt:CodeType>Id</mombt:CodeType>
								<mombt:CodingSystem>Intuit</mombt:CodingSystem>
								<mombt:Extended>
									<mombt:AlternativeCodeValue>String</mombt:AlternativeCodeValue>
									<mombt:AlternativeCodeDescription>String</mombt:AlternativeCodeDescription>
									<mombt:AlternativeCodeType>String</mombt:AlternativeCodeType>
									<mombt:AlternativeCodingSystem>String</mombt:AlternativeCodingSystem>
									<mombt:AssigningAuthority>
										<mombt:NamespaceID>String</mombt:NamespaceID>
										<mombt:UniversalID>String</mombt:UniversalID>
										<mombt:UniversalIDType>String</mombt:UniversalIDType>
									</mombt:AssigningAuthority>
									<mombt:CheckDigit>
										<mombt:CheckDigitType>M11</mombt:CheckDigitType>
										<mombt:CheckDigitValue>String</mombt:CheckDigitValue>
									</mombt:CheckDigit>
									<mombt:AssigningFacility>
										<mombt:NamespaceID>String</mombt:NamespaceID>
										<mombt:UniversalID>String</mombt:UniversalID>
										<mombt:UniversalIDType>String</mombt:UniversalIDType>
									</mombt:AssigningFacility>
								</mombt:Extended>
							</mombt:IDs>
							<mombt:Name Audience="text">
								<mombt:Title>String</mombt:Title>
								<mombt:First>String</mombt:First>
								<mombt:Middle>String</mombt:Middle>
								<mombt:Last>String</mombt:Last>
								<mombt:Suffix>String</mombt:Suffix>
								<mombt:NameType>Legal</mombt:NameType>
								<mombt:Degree>String</mombt:Degree>
							</mombt:Name>
							<mombt:Speciality>String</mombt:Speciality>
						</mombt:Provider>
					</PatientMsgBase>
					<Status>Processed</Status>
					<Comment>String</Comment>
					<Datetime>1967-08-13</Datetime>
					<AppointmentDatetime>1967-08-13</AppointmentDatetime>
					<AppointmentProvider Audience="text">
						<mombt:Npi>String</mombt:Npi>
						<mombt:Role>String</mombt:Role>
						<mombt:IDs Audience="text">
							<mombt:CodeValue>??22393??</mombt:CodeValue>
							<mombt:CodeDescription>Provider</mombt:CodeDescription>
							<mombt:CodeType>Id</mombt:CodeType>
							<mombt:CodingSystem>Intuit</mombt:CodingSystem>
							<mombt:Extended>
								<mombt:AlternativeCodeValue>String</mombt:AlternativeCodeValue>
								<mombt:AlternativeCodeDescription>String</mombt:AlternativeCodeDescription>
								<mombt:AlternativeCodeType>String</mombt:AlternativeCodeType>
								<mombt:AlternativeCodingSystem>String</mombt:AlternativeCodingSystem>
								<mombt:AssigningAuthority>
									<mombt:NamespaceID>String</mombt:NamespaceID>
									<mombt:UniversalID>String</mombt:UniversalID>
									<mombt:UniversalIDType>String</mombt:UniversalIDType>
								</mombt:AssigningAuthority>
								<mombt:CheckDigit>
									<mombt:CheckDigitType>ISO</mombt:CheckDigitType>
									<mombt:CheckDigitValue>String</mombt:CheckDigitValue>
								</mombt:CheckDigit>
								<mombt:AssigningFacility>
									<mombt:NamespaceID>String</mombt:NamespaceID>
									<mombt:UniversalID>String</mombt:UniversalID>
									<mombt:UniversalIDType>String</mombt:UniversalIDType>
								</mombt:AssigningFacility>
							</mombt:Extended>
						</mombt:IDs>
						<mombt:Name Audience="text">
							<mombt:Title>String</mombt:Title>
							<mombt:First>String</mombt:First>
							<mombt:Middle>String</mombt:Middle>
							<mombt:Last>String</mombt:Last>
							<mombt:Suffix>String</mombt:Suffix>
							<mombt:NameType>Legal</mombt:NameType>
							<mombt:Degree>String</mombt:Degree>
						</mombt:Name>
						<mombt:Speciality>String</mombt:Speciality>
					</AppointmentProvider>
				</AptRequestProcessed>
			</MessageContent>
		</AllscriptsMessageEnvelope>
	</S:Body>
</S:Envelope>